NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_sysctrl.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nRF54h20_sysctrl</name>
  <series>nRF54h</series>
  <version>1</version>
  <description>nRF54H20 reference description for system-on-chip with many ARM 32-bit Cortex-M33 microcontrollers</description>
  <licenseText>
Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <headerSystemFilename>system_nrf54h20_sysctrl</headerSystemFilename>
  <vendorExtensions>
    <MaxInterrupts>480</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>GLOBAL_FICR</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x0FFFE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>BLE</name>
          <description>Unspecified</description>
          <headerStructName>FICR_BLE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x00C</addressOffset>
          <register>
            <name>ADDRTYPE</name>
            <description>Device address type.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TYPE</name>
                <description>Device address type.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Public</name>
                    <description>Public address.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Random</name>
                    <description>Random address.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ADDR[%s]</name>
            <description>Description collection: 48 bit device address.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Device address [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ER[%s]</name>
            <description>Description collection: Encryption Root.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ER</name>
                <description>Encryption root word [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>IR[%s]</name>
            <description>Description collection: Identity Root.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IR</name>
                <description>Identity root word [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x040</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>TAGHEADER[%s]</name>
            <description>Description collection: Default header for NFC Tag.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD0</name>
                <description>Unique identifier byte 0</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x050</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MRAM</name>
            <description>MRAM variant</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MRAM</name>
                <description>MRAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size in bytes</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00001000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000100</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <cluster>
            <name>GLOBAL</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_GLOBAL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x288</addressOffset>
            <cluster>
              <name>SAADC</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_SAADC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <dim>0x3</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CAL[%s]</name>
                <description>Description collection: Trim value for GLOBAL.SAADC.CAL</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>CALREF</name>
                <description>Trim value for GLOBAL.SAADC.CALREF</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x6</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>LINCALCOEFF[%s]</name>
                <description>Description collection: Trim value for GLOBAL.SAADC.TRIM.LINCALCOEFF</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>NFCT</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_NFCT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x2C</addressOffset>
              <register>
                <name>BIASCFG</name>
                <description>Trim value for NFCT.BIASCFG</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>CANPLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_CANPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x30</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_GLOBAL_CANPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for GLOBAL.CANPLL.TRIM.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>COMP</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_COMP</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <register>
                <name>REFTRIM</name>
                <description>Trim value for GLOBAL.COMP.REFTRIM</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>APPLICATION</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_APPLICATION</headerStructName>
            <access>read-write</access>
            <addressOffset>0x2C8</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_APPLICATION_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_APPLICATION_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for APPLICATION.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for APPLICATION.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
